
var links=["Моё хобби",
			"Мои любимые книги",
			"Моя любимая музыка",
			"Мои любимые фильмы"];
var nameLinks=["hobby",
				"books",
				"musics",
				"films"]
var list=[["Программирование"],
		   ["Принцесса рок-н-ролла"],
		   	["Кино", "Ария", "Король и Шут", "Наив", "FPG", "Dругой ветер", "Dino MC47", "Louna"],
		   	["Побег из Шоушенка", "Форест Гамп", "Зелённая милля", "Подмена", "Луна-Одесса", "Леон", "Поймай меня если сможешь", "…а в душе я танцую", "11 друзей Оушена", "Хотабыч", "Убийства в Оксфорде", "Мемуары гейши", "Сердца в Атлантиде", "Фильмы с Джеки Чаном", "Друзья", "Пираты карибского моря", "Доктор Хаус", "Экстрималы"]];
function showLink() {
	var line=''
	for (var i = 0; i < links.length; i++) {
		line+='<section>'+
		'<a name="'+nameLinks[i]+'">'+
		'<h3>'+links[i]+'</h3>'+
		'</a>'+
		'<p>';
		for (var j = 0; j < list[i].length; j++) {
			line+=list[i][j]+'<br/>'
		};
		line+='</p>'+
		'</section>';
	};
	line+='</section>'
	document.getElementById('links').innerHTML+=line
}
